Конструктор_документов/src/Catalogs/кпдРазделыДокументов/кпдРазделыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кпдРазделыДокументов</name>
  <owners>Catalog.кпдКонструкторДокументов</owners>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Варианты</name>
    <attributes>
      <name>НазваниеВарианта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФайлСсылка</name>
      <type>
        <types>CatalogRef.Файлы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоАвтозаполнения</name>
      <type>
        <types>CatalogRef.ПравилаАвтозаполненияФайлов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПоУмолчанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Конструктор_документов/src/Catalogs/кпдРазделыДокументов/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ФайлыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ПараметрыДобавления = Новый Структура;
	ФайлыПередНачаломДобавленияКлиент(Элементы.Файлы, Истина, Ложь, Неопределено, Неопределено, ПараметрыДобавления);

КонецПроцедуры

&НаКлиенте
Процедура ФайлыПередНачаломДобавленияКлиент(Элемент, Отказ, Копирование, Родитель, Группа, ПараметрыДобавления)
	
	//Если Объект.Ссылка.Пустая()Тогда 
	//	Если Не Записать() Тогда 
	//		Возврат;
	//	КонецЕсли;
		
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Создание:'"), 
			ПолучитьНавигационнуюСсылку(Объект.Ссылка),
			Строка(Объект.Ссылка),
			БиблиотекаКартинок.Информация32);
			
	////ИначеЕсли ШаблонДокумента.Ссылка.Пустая() Тогда 
	//	ПараметрыЗаписи = Новый Структура("ЗаписатьШаблон", Истина);
	//	Если Не Записать(ПараметрыЗаписи) Тогда 
	//		Возврат;
	//	КонецЕсли;
	////КонецЕсли;
	
	Владелец = Объект.Ссылка;
	
	Если Не Копирование Тогда
		Попытка
			РежимСоздания = 2;
			НеОткрыватьФормуВыбораРежимаСозданияФайла = Истина;
			РаботаСФайламиКлиент.ДобавитьФайл(Неопределено, Владелец, 
				ЭтаФорма, РежимСоздания, Истина,,,,, НеОткрыватьФормуВыбораРежимаСозданияФайла);
		Исключение
			ПоказатьПредупреждение(, ФайловыеФункцииСлужебныйКлиентСервер.ОшибкаСозданияНовогоФайла(
				ИнформацияОбОшибке()));
		КонецПопытки;
	Иначе
		ТекущиеДанные = Элементы.Файлы.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда 
			Возврат;
		КонецЕсли;	
		ФайлОснование = ТекущиеДанные.Ссылка;
		
		РаботаСФайламиКлиент.СкопироватьФайл(Владелец, ФайлОснование);
	КонецЕсли;
	
	ЗаполнитьСписокФайлов();

	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокФайлов()
	
	МассивФайлов = РаботаСФайламиВызовСервера.ПолучитьВсеПодчиненныеФайлы(
		Объект.Ссылка, Ложь);
		
	ТаблицаФайлы = Делопроизводство.ПолучитьДанныеФайловДляСписка(МассивФайлов,,,Истина);
	ТаблицаФайлы.Колонки.Добавить("ПравилоАвтозаполнения");
	ТаблицаФайлы.Колонки.Добавить("НазваниеВарианта");
	ТаблицаФайлы.Колонки.Добавить("Номер");
	ТаблицаФайлы.Колонки.Добавить("ВариантПоУмолчанию");
		
	Для Каждого Строка Из Объект.Варианты Цикл
		НайденнаяСтрока = ТаблицаФайлы.Найти(Строка.ФайлСсылка, "Ссылка");
		Если НайденнаяСтрока <> Неопределено Тогда 
			НайденнаяСтрока.НазваниеВарианта = Строка.НазваниеВарианта;
			НайденнаяСтрока.ПравилоАвтозаполнения = Строка.ПравилоАвтозаполнения;
			НайденнаяСтрока.Номер = Строка.НомерСтроки;
			НайденнаяСтрока.ВариантПоУмолчанию = Строка.ВариантПоУмолчанию;
			//НайденнаяСтрока.ХранитьВерсии = Истина;
			//НайденнаяСтрока.РедактируетТекущийПользователь = Строка.РедактируетТекущийПользователь;
			//НайденнаяСтрока.Редактирует = Строка.Редактирует;
		КонецЕсли;
	КонецЦикла;

	
	Файлы.Очистить();
	Для Каждого Строка Из ТаблицаФайлы Цикл
		НоваяСтрока = Файлы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Файлы.Сортировать("Номер Возр");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Варианты.Очистить();
	Для Каждого Строка Из Файлы Цикл
		НоваяСтрока = ТекущийОбъект.Варианты.Добавить();
		НоваяСтрока.НазваниеВарианта = Строка.Наименование;
		НоваяСтрока.ФайлСсылка = Строка.Ссылка;
		НоваяСтрока.ПравилоАвтозаполнения = Строка.ПравилоАвтозаполнения;
		НоваяСтрока.Номер = Строка.Номер;
		НоваяСтрока.ВариантПоУмолчанию = Строка.ВариантПоУмолчанию;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ЗаполнитьСписокФайлов();		
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	Если Поле.Имя = "ФайлыСсылка" Тогда
		СтандартнаяОбработка = Ложь;
		Строка = Файлы.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если Строка = Неопределено Тогда 
			Возврат;
		КонецЕсли;	
		
		ПоказатьЗначение(, Строка.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлВыполнить()
	
	ТекущиеДанные = Элементы.Файлы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	ОткрытьФайл(ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Файл)
	
	Если Не ЗначениеЗаполнено(Файл) Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеФайла = РаботаСФайламиВызовСервера.ДанныеФайлаДляОткрытия(
		Файл, 
		Неопределено, 
		ЭтаФорма.УникальныйИдентификатор, 
		Неопределено, 
		ПредыдущийАдресФайла);
		
	КомандыРаботыСФайламиКлиент.Открыть(ДанныеФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	
	Если Объект.Ссылка.Пустая()
		И Элементы.ФайлыДобавленные.ТекущаяСтрока <> Неопределено Тогда
		Если ЭтоАдресВременногоХранилища(Элементы.ФайлыДобавленные.ТекущиеДанные.ПолныйПуть) Тогда 
			Записать();
		Иначе
			РаботаСФайламиКлиент.ЗапуститьПриложениеПоИмениФайла(
				Элементы.ФайлыДобавленные.ТекущиеДанные.ПолныйПуть);
		КонецЕсли;
	Иначе
		
		ТекущиеДанные = Элементы.Файлы.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда 
			Возврат;
		КонецЕсли;
			
		КомандыРаботыСФайламиКлиент.Редактировать(ТекущиеДанные.Ссылка);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьРедактирование(Команда)
	
	ТекущиеДанные = Элементы.Файлы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновленияФайла = РаботаСФайламиКлиент.ПараметрыОбновленияФайла(Неопределено, 
		ТекущиеДанные.Ссылка, ЭтаФорма.УникальныйИдентификатор);
	ПараметрыОбновленияФайла.ХранитьВерсии = ТекущиеДанные.ХранитьВерсии;
	ПараметрыОбновленияФайла.РедактируетТекущийПользователь = ТекущиеДанные.РедактируетТекущийПользователь;
	ПараметрыОбновленияФайла.Редактирует = ТекущиеДанные.Редактирует;
	РаботаСФайламиКлиент.ЗакончитьРедактированиеСОповещением(ПараметрыОбновленияФайла);
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПравило(Команда)
	
	#Если ВебКлиент Тогда
		Сообщение = НСтр("ru = 'В web-клиенте нельзя осуществлять проверку правил.'");
		ПоказатьПредупреждение(,Сообщение);
		Возврат;
	#КонецЕсли
	
	ТекущиеДанные = Элементы.Файлы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(ТекущиеДанные.ПравилоАвтозаполнения) Тогда 
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПроверитьПравилоПродолжениеПослеВыбораДокумента",
		ЭтотОбъект,
		Новый Структура("ШаблонФайла, Расширение", 
			ТекущиеДанные.Ссылка,
			ТекущиеДанные.Расширение));
	
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("ВидДокумента", Объект.ВидДокумента));
	ОткрытьФорму(
		"Справочник.ВнутренниеДокументы.ФормаВыбора", 
		ПараметрыФормы, 
		ЭтаФорма,,,,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЭлементВверх(Команда)
	
	ТекущаяСтрока = Элементы.Файлы.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		Отбор = Новый Структура();
		Отбор.Вставить("Ссылка", ТекущаяСтрока.Ссылка);
		НайденныеСтроки = Файлы.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			НомерСтроки = НайденныеСтроки[0].Номер; 
			Если НомерСтроки <= 1 Тогда
				Возврат;
			Иначе
				СтрокаВыщеТекущей = Файлы[НомерСтроки - 2];	
				Файлы.Сдвинуть(НомерСтроки - 1, -1);
				НайденныеСтроки[0].Номер = НомерСтроки - 1;
				
				СтрокаВыщеТекущей.Номер = СтрокаВыщеТекущей.Номер + 1;  
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЭлементВниз(Команда)
	ТекущаяСтрока = Элементы.Файлы.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		Отбор = Новый Структура();
		Отбор.Вставить("Ссылка", ТекущаяСтрока.Ссылка);
		НайденныеСтроки = Файлы.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			НомерСтроки = НайденныеСтроки[0].Номер; 
			Если НомерСтроки >= Файлы.Количество() Тогда
				Возврат;
			Иначе
				СтрокаНижеТекущей = Файлы[НомерСтроки];	
				Файлы.Сдвинуть(НомерСтроки - 1, 1);
				НайденныеСтроки[0].Номер = НомерСтроки + 1;
				
				СтрокаНижеТекущей.Номер = СтрокаНижеТекущей.Номер - 1;  
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуФайла(Команда)
	ТекущиеДанные = Элементы.Файлы.ТекущиеДанные; 
	Если ТекущиеДанные = Неопределено Тогда 
			Возврат;
	КонецЕсли;	
		
	ПоказатьЗначение(, ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Файлы.ТекущиеДанные;
	ФайлыПередУдалениемНаСервере(ТекущиеДанные.Ссылка);
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ФайлыПередУдалениемНаСервере(ФайлСсылка)
	
	ЭлементОбъект = ФайлСсылка.ПолучитьОбъект();
	ЭлементОбъект.Заблокировать();
	ЭлементОбъект.УстановитьПометкуУдаления(Истина, Истина);
	
КонецПроцедуры
